app/views/orders/_form.html.erb

    <div id="error_explanation">
      <h2><%=raw t('errors.template.header', count: @order.errors.count,
		model: t('activerecord.models.order')) %>.</h2
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "980190962"]]