app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)

    @order.add_line_items_from_cart(@cart)


    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 21 Apr 2014 11:18:36 UTC +00:00], ["updated_at", Mon, 21 Apr 2014 11:18:36 UTC +00:00]]
INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 980190963]]