app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("created_at", "description", "image_url", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 13 Apr 2014 09:01:05 UTC +00:00], ["description", ""], ["image_url", ""], ["title", ""], ["updated_at", Sun, 13 Apr 2014 09:01:05 UTC +00:00]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "title" = ?, "updated_at" = ? WHERE "products"."id" = 2  [["title", "CoffeeScript"], ["updated_at", Sun, 13 Apr 2014 14:38:17 UTC +00:00]]

  def who_bought
    @product = Product.find(params[:id])
    @latest_order = @product.orders.order(:updated_at).last
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY "products"."id" ASC LIMIT 1  [["id", 2]]
SELECT "orders".* FROM "orders" INNER JOIN "line_items" ON "orders"."id" = "line_items"."order_id" WHERE "line_items"."product_id" = ? ORDER BY "orders"."updated_at" DESC LIMIT 1  [["product_id", 3]]